## Pivot Table

In [22]:
import pandas as pd

data = {
    "Date": [
        "2025-01-01","2025-01-01","2025-01-02","2025-01-02","2025-01-03",
        "2025-01-03","2025-01-04","2025-01-04","2025-01-05","2025-01-05"
    ],
    "Region": [
        "North","South","North","East","West",
        "South","East","North","West","South"
    ],
    "Product": [
        "Laptop","Mobile","Laptop","Tablet","Mobile",
        "Laptop","Tablet","Mobile","Laptop","Tablet"
    ],
    "Salesperson": [
        "Amit","Riya","Amit","Neha","Rahul",
        "Riya","Neha","Amit","Rahul","Neha"
    ],
    "Units_Sold": [2, 5, 1, 3, 4, 2, 2, 6, 1, 3],
    "Revenue": [120000, 75000, 60000, 45000, 60000, 120000, 30000, 90000, 60000, 45000]
}

df = pd.DataFrame(data)
df

         Date Region Product Salesperson  Units_Sold  Revenue
0  2025-01-01  North  Laptop        Amit           2   120000
1  2025-01-01  South  Mobile        Riya           5    75000
2  2025-01-02  North  Laptop        Amit           1    60000
3  2025-01-02   East  Tablet        Neha           3    45000
4  2025-01-03   West  Mobile       Rahul           4    60000
5  2025-01-03  South  Laptop        Riya           2   120000
6  2025-01-04   East  Tablet        Neha           2    30000
7  2025-01-04  North  Mobile        Amit           6    90000
8  2025-01-05   West  Laptop       Rahul           1    60000
9  2025-01-05  South  Tablet        Neha           3    45000

In [23]:
pd.pivot_table(df,values="Revenue",index="Region",columns="Product") #ByDefault It Calculate Mean (aggfnc='mean')

Product    Laptop   Mobile   Tablet
Region
East          NaN      NaN  37500.0
North     90000.0  90000.0      NaN
South    120000.0  75000.0  45000.0
West      60000.0  60000.0      NaN

In [24]:
pd.pivot_table(df,values="Units_Sold",index="Salesperson",columns="Region",aggfunc='max')

Region       East  North  South  West
Salesperson
Amit          NaN    6.0    NaN   NaN
Neha          3.0    NaN    3.0   NaN
Rahul         NaN    NaN    NaN   4.0
Riya          NaN    NaN    5.0   NaN

In [25]:
pd.pivot_table(df,values="Revenue",index="Salesperson",aggfunc='sum')

             Revenue
Salesperson
Amit          270000
Neha          120000
Rahul         120000
Riya          195000